{
  "header": {
    "home": "Home",
    "portfolio": "Portfolio",
    "about": "About",
    "contact": "Contact"
  },
  "socialIcons": {
    "followText": "Follow me"
  },
  "home": {
    "greeting": "Hello, I'm Dário Soares",
    "title1": "Full Stack Developer",
    "title2": "React & TypeScript",
    "title3": "Modern Web Development",
    "description": "Developer passionate about creating amazing and functional web experiences using the most modern technologies on the market.",
    "portfolioButton": "My Portfolio",
    "contactButton": "Contact",
    "meta": {
      "title": "Dário Soares - Full Stack Developer",
      "description": "Dário Soares - Full Stack Developer specialized in React, TypeScript and modern web development"
    }
  },
  "about": {
    "pageTitle": "About me",
    "sectionTitle": "A little about me",
    "description": "Full Stack Developer with a passion for creating modern and efficient web solutions. Specialized in React, TypeScript, Node.js and modern development technologies. Focused on writing clean, performant and scalable code.",
    "role": "Full Stack Developer specialized in building web products that solve real business problems.",
    "problemTitle": "What I Solve",
    "problemText": "Companies lose money with slow systems, confusing interfaces and manual processes. I build fast, intuitive and automated applications that increase conversions and save time.",
    "toolsTitle": "Tools",
    "experienceTitle": "Experience",
    "skillsTitle": "Skills",
    "servicesTitle": "Services",
    "meta": {
      "title": "About | Dário Soares",
      "description": "Dário Soares - Full Stack Developer specialized in React, TypeScript and modern web development"
    },
    "workTimeline": {
      "job1": {
        "title": "Full Stack Developer",
        "company": "Freelancer",
        "date": "2023 - Present"
      },
      "job2": {
        "title": "Frontend Developer",
        "company": "Personal Projects",
        "date": "2022 - 2023"
      },
      "job3": {
        "title": "Web Developer",
        "company": "Studies & Training",
        "date": "2021 - 2022"
      }
    },
    "services": {
      "service1": {
        "title": "Web Development",
        "description": "Creation of modern, responsive and performance-optimized websites and web applications using React, TypeScript and market best practices."
      },
      "service2": {
        "title": "Frontend Development",
        "description": "Development of intuitive and attractive user interfaces, with a focus on user experience and responsive design for all devices."
      },
      "service3": {
        "title": "Technical Consulting",
        "description": "Advice on software architecture, technology selection and development best practices for web projects of any scale."
      }
    }
  },
  "contact": {
    "pageTitle": "Contact",
    "subtitle": "Get in touch",
    "description": "Have a project in mind or want to work together? Drop me an email — I'll get back to you as soon as possible.",
    "emailLabel": "Email",
    "emailDescription": "Best way to reach me. I typically reply within 24 hours.",
    "emailAction": "Send Email",
    "cvLabel": "Curriculum Vitae",
    "cvTitle": "Download CV",
    "cvDescription": "Full overview of my experience, education and technical skills.",
    "cvAction": "Download PDF",
    "meta": {
      "title": "Contact | Dário Soares",
      "description": "Get in touch with Dário Soares for projects and collaborations"
    }
  },
  "portfolio": {
    "subtitle": "Recent Work",
    "pageTitle": "Portfolio",
    "description": "These projects demonstrate my experience with practical examples of my work. Each project includes a brief description and links to code repositories and live demos.",
    "viewCode": "View code",
    "viewDemo": "View demo",
    "meta": {
      "title": "Portfolio | Dário Soares",
      "description": "Projects and works developed by Dário Soares - Full Stack Developer"
    },
    "projects": {
      "project1": {
        "title": "Biblioteca ISLA Gaia",
        "description": "Web application for school library management, allowing loan and return management of books, title search and user management."
      },
      "project2": {
        "title": "Arte em Ponto Ecommerce",
        "description": "E-commerce platform for selling unique crochet creations, with shopping cart functionality, secure payment and inventory management."
      },
      "project3": {
        "title": "Junta de Freguesia de Sermonde",
        "description": "Institutional website for Junta de Freguesia de Sermonde, with information about services, events and contacts."
      },
      "project4": {
        "title": "Oxlyn Software",
        "description": "Development studio specialized in scripts and resources for FiveM servers — the leading multiplayer modification platform for GTA V. Our products empower server owners to build unique roleplay experiences, featuring custom job systems, economies, inventories, and mechanics tailored to their communities"
      }
    }
  }
}
